tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "git"
brew "uv"
cask "rectangle"
cask "visual-studio-code"

cask 'iterm2'

# Lynx terminal web browser
brew 'lynx'

# Bitwarden password manager, which is open-source
cask 'bitwarden'

# Vim editor
brew 'vim'

# curl is a command line tool for transferring data with URL syntax.
brew 'curl', link: true

# Wget is a free software package for retrieving files using HTTP and FTP.
brew 'wget'

# Basic file, shell and text manipulation utilities of the GNU operating system.
brew 'coreutils'

brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gzip'
brew 'watch'
brew 'wdiff'


##
# Some GNU command line tools already exist by default on OS X.
# We choose to replace these with newer versions.
##
brew 'gpatch'
brew 'm4'
brew 'make'
brew 'nano'



# Automake is a tool for automatically generating Makefile installation files.
brew 'automake'

# OpenSSL is an open-source implementation of the SSL and TLS protocols.
brew 'openssl'

# pkg-config is a helper tool used when compiling applications and libraries.
brew 'pkg-config', link: true

# Functions for use by applications that allow users to edit command lines while typing.
brew 'readline'

# cloud stuff
cask "google-cloud-sdk"
brew "terraform"
brew "kubectx"

brew "youtube-dl"
cask "aerial"
cask "keepingyouawake"
cask "monitorcontrol"
cask "menumeters"
brew "the_silver_searcher"
brew "htop"
brew "httpie"
brew "jq"
brew "npm"
cask "rocket"
brew "lazydocker"
