ack
adns
apple-gcc42
autoconf
automake
bash
blackbox
cmake
cmatrix
cocoapods
coreutils
ctags
dfu-util
ffmpeg
findutils
fish
fontconfig
freetype
fzf
gcc
gd
gdbm
gettext
git
glib
gmp
gnupg
gnutls
graphviz
grep
hdf5
htop
htop-osx
httpie
icu4c
isl
jemalloc
jpeg
kafkacat
kubernetes-cli
lame
lastpass-cli
lesspipe
libassuan
libevent
libffi
libgcrypt
libgpg-error
libidn
libksba
libmpc
libpng
librdkafka
libtasn1
libtermkey
libtiff
libtool
libunistring
libusb
libuv
libvterm
libyaml
lz4
lzlib
mpfr
msgpack
mysql@5.5
neovim
nettle
nmap
node
npth
openblas
openssl
openssl@1.1
p11-kit
p7zip
parallel
pcre
pcre2
pinentry
pkg-config
python
readline
reattach-to-user-namespace
sbt@0.13
sl
socat
sqlite
sshfs
stress
szip
terminal-notifier
the_silver_searcher
tmux
torsocks
tree
unibilium
watch
webp
wget
x264
xvid
xz
yajl
youtube-dl
